{
    "title": "Francisco Cornejo | Portafolio",
    "description": "Descripción",
    "image": "/foto_perfil.jpg",
    "avatar": "/foto_perfil.jpg",
    "name": "Francisco Cornejo",
    "skill": "Desarrollador back-end",
    "location": "Córdoba, Argentina",
    "media": {
        "email": "francisco.cornejo1978@gmail.com",
        "cv": "/data/CV Francisco Cornejo.pdf",
        "github": "https://github.com/CornejoFrancisco",
        "likedin": "https://www.linkedin.com/in/franciscocornejo-/"
    },
    "about": "Soy estudiante de cuarto año de Ingeniería en Sistemas de Información en la Facultad UTN - Regional Córdoba, mi objetivo es aprender y resolver problemas. Destaco por mi capacidad para adaptarme rápidamente a nuevas situaciones y trabajar eficazmente en equipos interdisciplinarios. Mi enfoque proactivo y mi voluntad de aprender me permiten abordar desafíos con determinación y creatividad. Me siento comprometido con la excelencia académica y el desarrollo profesional, busco oportunidades para aplicar mis habilidades técnicas y contribuir al éxito de proyectos innovadores. Con una mentalidad abierta y curiosidad constante, estoy preparado para enfrentar los desafíos cambiantes del campo de la ingeniería de sistemas con entusiasmo y determinación.",
    "technologies": [
        {
            "icon": "devicon-java-plain",
            "name": "Java"
        },
        {
            "icon": "devicon-python-plain",
            "name": "Python"
        },
        {
        "icon": "devicon-express-original",
            "name" : "Express"
        },
        {
            "icon": "devicon-nodejs-plain",
            "name": "Node.js"
        },
        {
            "icon": "devicon-mysql-plain",
            "name": "MySql"
        },
        {
            "icon": "devicon-spring-original",
            "name": "Spring Boot"
        },
        {
            "icon": "devicon-postman-plain",
            "name": "Postman"
        }
        
    ],
    "projects": [
        {
            "icon": "bike",
            "title": "Alquiler de bicicletas",
            "subtitle": "Gestion de alquileres de bicicletas en Córdoba",
            "description": "Desarrollo de un sistema de alquiler de bicicletas para una ciudad. El sistema permitirá a los clientes registrados alquilar bicicletas, retirándolas de una estación y devolviéndolas en otra. Se garantiza la disponibilidad de bicicletas y espacio en las estaciones. El costo del alquiler se calcula al devolver la bicicleta, incluyendo un costo fijo, un costo por hora y un cargo por distancia entre estaciones. En días promocionales, se aplican descuentos. Los clientes pueden ver el costo en distintas monedas. Además, el sistema permitirá a los administradores agregar estaciones y obtener listados de alquileres.",
            "technologies": [
                {
                    "icon": "devicon-java-plain",
                    "name": "Java"
                },
                {
                    "icon": "devicon-mysql-original",
                    "name": "MySql"
                },
                {
                    "icon": "devicon-hibernate-plain",
                    "name": "Hibernate"
                },
                {
                    "icon": "devicon-Microservicios-plain",
                    "name": "Microservicios"
                },
                {
                    "icon": "devicon-spring-original",
                    "name": "Spring Boot"
                }
            ],
            "image": "/2.jpg",

            "github": "https://github.com/CornejoFrancisco/AlquilerBiciBackenEnd"
        },
        {
            "icon": "car",
            "title": "Empresa de alquiler de autos",
            "subtitle": "Descripción del Sistema de Gestión de Alquiler de Autos",
            "description": "Estamos desarrollando una API para una empresa especializada en alquiler de autos para compañías. Esta API permite gestionar alquileres, pagos, vehículos y clientes a través de varios endpoints: FinancialController para ver y gestionar alquileres pendientes de cobro y registrar pagos; CarRentalController con operaciones CRUD para gestionar alquileres, incluyendo la actualización del estado de pago; VehicleController para la gestión de vehículos, incluyendo la visualización de vehículos disponibles, adición, baja y actualización de millaje; ClientCompanyController que ofrece funcionalidades para administrar empresas clientes, como la creación, eliminación (si no hay alquileres impagos), consulta y asociación de empleados; y ClientController que gestiona operaciones CRUD estándar para clientes. Este sistema integral facilita la administración eficiente del alquiler de vehículos, optimizando tanto la operativa diaria como la gestión administrativa para la empresa de alquiler de autos.",

            "technologies": [
                {
                    "icon": "devicon-java-plain",
                    "name": "Java"
                },
                {
                    "icon": "devicon-spring-original",
                    "name": "Spring Boot"
                }
            ],
            "image": "/3.jpg",
            "github": "https://github.com/CornejoFrancisco/BackEndPractica"
        },
        {
            "icon": "shopping-cart",
            "title": "Gestor de biblioteca",
            "subtitle": "Sistema de gestión de biblioteca que facilita la administración de libros disponibles y los préstamos asociados.",
            "description": "Permite registrar usuarios, gestionar préstamos y devoluciones, así como registrar autores y libros en el inventario.",
            "technologies": [
                {
                    "icon": "devicon-python-plain",
                    "name": "Python"
                },
                {
                    "icon": "devicon-mysql-original",
                    "name" : "MySql"
                }
            ],
            "image": "/6.jpg",
            "github": "https://github.com/CornejoFrancisco/DAO"
        },
        {
            "icon": "line-chart",
            "title": "Modelo monte carlo simulación",
            "subtitle": "En este proyecto, desarrollé un modelo de simulación de Monte Carlo para determinar la mejor política de compra para un negocio específico.",
            "description": "La simulación de Monte Carlo es una técnica de modelado que permite estimar la probabilidad de diferentes resultados en un proceso que no se puede fácilmente predecir debido a la intervención de variables aleatorias.",
            "technologies": [
                {
                    "icon": "devicon-java-plain",
                    "name": "Java"
                },
                {
                    "icon": "devicon-spring-original-wordmark",
                    "name": "Spring Boot"
                }

            ],
            "image": "/4.jpg",
            "github": "https://github.com/CornejoFrancisco/ModeloMonteCarlo"
        },
        {
            "icon": "line-chart",
            "title": "Simulacion de Banco",
            "subtitle": "En este proyecto, desarrollé la simulacion de un banco con algunas funcionalidad basicas.",
            "description": "Este simulador de banco está desarrollado con Spring Boot y permite la gestión de cuentas bancarias, incluyendo la creación de cuentas, transferencias entre ellas y la consulta de saldos.",
            "technologies": [
                {
                    "icon": "devicon-java-plain",
                    "name": "Java"
                },
                {
                    "icon": "devicon-hibernate-plain",
                    "name": "Hibernate"
                },
                {
                    "icon": "devicon-mysql-plain",
                    "name": "MySql"
                },
                {
                    "icon": "devicon-spring-original-wordmark",
                    "name": "Spring Boot"
                }

            ],
            "image": "/5.jpg",
            "github": "https://github.com/CornejoFrancisco/bank"
        }
    ],
    "training": [
        {
            "icon": "graduation-cap",
            "title": "Estudiante de ingenieria en sistemas de informacion",
            "subtitle": "Inicio de estudios: Marzo 2021 - Actualmente",
            "description": "",
            "date": ""
        }
    ]
}